{
  "backend/main.mo": "Defines the main Motoko canister with menu, orders, documents, notifications, access control, and storage logic, including types and basic CRUD operations.",
  "feature_evidence.json": "Contains feature evidence metadata mapping features to related files, components, and test IDs for auditing.",
  "frontend-file-summaries.txt": "Lists short descriptive summaries for key frontend files used in the project.",
  "frontend/index.css": "Defines global Tailwind CSS variables and base styles for light and dark themes using OKLCH color tokens.",
  "frontend/index.html": "HTML entry file that loads fonts, metadata, PWA settings, and mounts the React app.",
  "frontend/public/manifest.json": "PWA manifest specifying app name, icons, theme colors, and display settings.",
  "frontend/public/service-worker.js": "Implements caching strategies for static and dynamic assets, handles fetch events, and manages service worker lifecycle.",
  "frontend/src/App.tsx": "Sets up TanStack Router routes, theme provider, cart context, and global UI elements for the React app.",
  "frontend/src/components/CartContext.tsx": "Provides a React context for cart state with add, remove, update, clear, and total calculation logic.",
  "frontend/src/components/Footer.tsx": "Renders the site footer with restaurant info, dynamic location, contact details, and operating hours.",
  "frontend/src/components/Header.tsx": "Displays the top navigation bar with links, cart and notification indicators, user auth controls, and mobile menu.",
  "frontend/src/components/InstallPrompt.tsx": "Handles PWA install prompt events and shows a dismissible UI for installing the app.",
  "frontend/src/components/Layout.tsx": "Wraps pages with a persistent header and footer and renders route content via Outlet.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/StripeSetup.tsx": "Admin-only form to configure Stripe payment settings and save secret keys and allowed countries.",
  "frontend/src/constants/menuCategories.ts": "Defines shared menu category lists for user and admin views.",
  "frontend/src/constants/whatsapp.ts": "Exports WhatsApp phone number and base URL for click-to-chat links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, initializing access control and invalidating dependent queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for Internet Identity authentication, managing identity loading, login, logout, and status tracking. Wraps AuthClient creation with custom defaults.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for interacting with backend actor methods, covering menu items, orders, Stripe setup, and user‑specific data. Handles data fetching, mutations, and cache invalidation.",
  "frontend/src/index.css": "Sets global Tailwind styles, theming variables for light/dark modes, typography, and custom component classes. Establishes a warm, food‑oriented design palette.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with QueryClientProvider and InternetIdentityProvider. Loads global styles and renders the root component.",
  "frontend/src/pages/AdminPage.tsx": "Admin dashboard for managing orders, menu items, notifications, Stripe config, and restaurant settings. Uses many query hooks and forms for CRUD operations and status updates.",
  "frontend/src/pages/CheckoutPage.tsx": "Implements checkout flow using Stripe or WhatsApp, validating identity, building shopping items, and redirecting to Stripe. Displays cart items and handles quantity updates.",
  "frontend/src/pages/ContactPage.tsx": "Renders a contact page showing location, phone, hours, and WhatsApp actions using fetched restaurant data. Includes interactive buttons for calling and messaging.",
  "frontend/src/pages/HomePage.tsx": "Displays the homepage with a hero section, navigation buttons, and feature cards promoting the restaurant. Includes WhatsApp messaging and menu navigation.",
  "frontend/src/pages/MenuPage.tsx": "Fetches and displays menu items with category filtering, loading states, and add‑to‑cart functionality. Supports image previews and sorted, filtered item listings.",
  "frontend/src/pages/NotificationsPage.tsx": "Shows user and broadcast notifications with icons, timestamps, and read-status handling. Supports navigation to order details and requires authentication.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Displays a sortable list of user orders with statuses and timestamps, handling authentication and loading states. Allows navigation to individual order details.",
  "frontend/src/pages/OrderTrackingPage.tsx": "Displays order tracking details with status indicators, handling loading, auth, and error states.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment-cancelled message with options to retry checkout or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Processes Stripe payment confirmation, creates an order, clears the cart, and shows success details.",
  "frontend/src/utils/menuUpdates.ts": "Empty placeholder file for future menu update utilities.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/whatsapp.ts": "Generates WhatsApp deep links and formatted order messages for sharing cart details.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, fonts, container settings, shadows, and plugins for the project.",
  "project_state.json": "Tracks project state, known issues, and UI enhancement feature definitions for the redesign effort."
}