{
  "backend/main.mo": "Main restaurant canister implementing menu, orders, documents, notifications, access control, blob storage, and Stripe config with state maps and helper functions.",
  "backend/migration.mo": "Migration module defining old/new state types and a run function that updates restaurant location URL while preserving existing data.",
  "feature_evidence.json": "Empty feature evidence report structure.",
  "frontend-file-summaries.txt": "List of prewritten summaries describing each frontend file's purpose and functionality.",
  "frontend/index.css": "Tailwind base and theme variables defining OKLCH color tokens for light and dark modes.",
  "frontend/index.html": "HTML entrypoint setting metadata, PWA manifest, icons, and root mounting element.",
  "frontend/public/manifest.json": "PWA manifest describing app name, icons, theme colors, and display settings.",
  "frontend/public/service-worker.js": "Service worker implementing static caching, dynamic caching, network strategies, and skip-waiting message handling.",
  "frontend/src/App.tsx": "App root configuring routes, theme provider, cart context, toaster, and install prompt.",
  "frontend/src/components/CartContext.tsx": "React context managing cart items with add, remove, update, clear, and total calculation.",
  "frontend/src/components/Footer.tsx": "Displays the site footer with restaurant info, dynamic location fallback, contact details, and operating hours.",
  "frontend/src/components/Header.tsx": "Provides the main navigation bar with links, cart summary, notifications, login state, and admin access.",
  "frontend/src/components/InstallPrompt.tsx": "Shows a custom PWA installation prompt triggered by the beforeinstallprompt event with install and dismiss options.",
  "frontend/src/components/Layout.tsx": "Wraps the app with a shared header and footer around routed page content.",
  "frontend/src/components/LoginButton.tsx": "Handles Internet Identity login/logout with status feedback and error recovery.",
  "frontend/src/components/StripeSetup.tsx": "Admin-only form for configuring Stripe secret keys and allowed countries with validation and feedback.",
  "frontend/src/constants/menuCategories.ts": "Defines shared menu categories and admin-specific categories for item management.",
  "frontend/src/constants/whatsapp.ts": "Stores WhatsApp phone and base URL constants for click‑to‑chat links.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity and refreshes dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides authentication context using Internet Identity, supporting login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating menu items, orders, user roles, notifications, and restaurant settings via the actor API.",
  "frontend/src/index.css": "Sets Tailwind base styles and theme CSS variables for light and dark modes.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/AdminPage.tsx": "Implements the admin dashboard for managing orders, menu items, broadcast messages, and restaurant settings.",
  "frontend/src/pages/CheckoutPage.tsx": "Handles cart checkout, Stripe session creation, and WhatsApp order fallback.",
  "frontend/src/pages/ContactPage.tsx": "Displays restaurant contact details, location, hours, and WhatsApp quick contact options.",
  "frontend/src/pages/HomePage.tsx": "Provides the landing page with hero content, feature highlights, and WhatsApp contact link.",
  "frontend/src/pages/MenuPage.tsx": "Displays the menu with category filters, loads items from the backend, shows skeletons while loading, and allows adding items to the cart.",
  "frontend/src/pages/NotificationsPage.tsx": "Fetches and displays user notifications with icons and statuses, supports marking notifications as read and navigating to related orders.",
  "frontend/src/pages/OrderHistoryPage.tsx": "Shows a table of the user's past orders with status labels, loading states, and navigation to order details.",
  "frontend/src/pages/OrderTrackingPage.tsx": "Displays detailed tracking information for a specific order with status-based styling, loading and error states, and navigation back to order history.",
  "frontend/src/pages/PaymentFailurePage.tsx": "Shows a payment cancellation message with options to return to checkout or continue shopping.",
  "frontend/src/pages/PaymentSuccessPage.tsx": "Verifies Stripe payment, creates an order, clears the cart, and displays order confirmation or processing status.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters (including hash), persist them in sessionStorage, and clear them from storage or the URL hash.",
  "frontend/src/utils/whatsapp.ts": "Builds WhatsApp deep links and formats an order message from cart items and totals.",
  "frontend/tailwind.config.js": "Defines Tailwind setup with theme extensions, custom colors, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Stores project metadata, issues, and feature requests related to updating the Contact page map coordinates."
}